
LookUnderTheBed = False
OpenTheBox = False
OpenTheVentilation = False
LookAtTheBedsideTable = False
Statue = False
vnt = 0
r = True
print("Вы проснулись в комнате которую вы видете в первый раз.")
print("Вы пытаетесь вспомнить своё имя.")
name = input('Введите имя: ')
print(f"Кажется вас зовут {name}.")
while r == True:
    print("Вы видете дверь(1), кровать(2), ящик(3), статую(4), вентиляцию(5) и тумбочку(6).")
    a = int(input('Куда посмотреть?: '))
    print("------------------------------------------------------------------------------------")
    if (a == 1):
        if (OpenTheBox == False):
            print("Дверь не открывается, кажется нужна отмычка.")
            print("------------------------------------------------------------------------------------")
        else:
            print("Вы открываете дверь. Свобода. Продолжение следует...")
            break
    elif (a == 2):
        if (LookUnderTheBed == False):
            print("Вы смотрете под кровать. Глаз под кроватью смотрит на вас.")
            print("Вы забираете глаз статуи из под кровати.")
            print("------------------------------------------------------------------------------------")
            LookUnderTheBed = True
        else:
            print("Вам нечего тут делать.")
            print("------------------------------------------------------------------------------------")
    elif (a == 3):
        if (Statue == False):
            print("На ящике большой замок. Кажется нужен ключ.")
            print("------------------------------------------------------------------------------------")
        else:
            if (OpenTheBox == False):
                print("Вы открываете ящик. На дне ящика вы нашли отмычку.")
                print("------------------------------------------------------------------------------------")
                OpenTheBox = True
            else:
                print("Вам нечего тут делать.")
                print("------------------------------------------------------------------------------------")
    elif (a == 4):
        if (Statue == False):

            if (LookUnderTheBed == True and OpenTheVentilation == True and LookAtTheBedsideTable == True):
                print("Вы вставляете глаза в глазницы статуи. Рука статуи отпускает ключ.")
                print("------------------------------------------------------------------------------------")
                Statue = True
            else:
                print("Вы видете статую в виде монстра с 3 пустыми глазницами, которая сжимает в руке ключ.")
                print("Кажется ей чего-то не хватает.")
                print("------------------------------------------------------------------------------------")
        else:
            print("Вам нечего тут делать.")
            print("------------------------------------------------------------------------------------")
    elif (a == 5):
        if (vnt < 2):
            print("Вы пытаетесь открыть вентиляцию. Вентиляция не поддаётся, попробуйте снова.")
            print("------------------------------------------------------------------------------------")
            vnt = vnt + 1
        else:
            if (OpenTheVentilation == False):
                print("Вы смотрете в вентиляцию. Глаз смотрит на вас.")
                print("Вы забираете глаз статуи из вентиляции.")
                print("------------------------------------------------------------------------------------")
                OpenTheVentilation = True
            else:
                print("Вам нечего тут делать.")
                print("------------------------------------------------------------------------------------")
    elif (a == 6):
        if (LookAtTheBedsideTable == False):
            print("Вы смотрете на тумбочку. Глаз смотрит на вас.")
            print("Вы забираете глаз статуи с тумбочки.")
            print("------------------------------------------------------------------------------------")
            LookAtTheBedsideTable = True
        else:
            print("Вам нечего тут делать.")
            print("------------------------------------------------------------------------------------")
    else:
        print("Нужно число от 1 до 6.")

